index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-12 Tue 01:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portfolio</title>
<meta name="author" content="Albin Babu Varghese" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Inter:wght@300;400;500;600;700;800&display=swap" rel="stylesheet">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Portfolio</h1>
<nav class="nav">
<a href="#about">About</a>
<a href="#skills">Skills</a>
<a href="#experience">Experience</a>
<a href="#oss">Open Source</a>
<a href="#projects">Projects</a>
<a href="#education">Education</a>
<a href="#volunteer">Volunteer</a>
<a href="#contact">Contact</a>
</nav>

<main class="wrap">

<section class="hero" id="about">
<div class="name">Albin Babu Varghese</div>
<div class="sub">Software Developer • Cloud & Linux • DevOps</div>
<div class="contact">
<a class="badge" href="mailto:mail@albinbabuvarghese.com">mail@albinbabuvarghese.com</a>
<a class="badge" href="https://github.com/albus-droid">github.com/albus-droid</a>
<a class="badge" href="https://www.linkedin.com/in/albin-babu-varghese/">linkedin.com/in/albin-babu-varghese</a>
<span class="badge">Toronto, ON</span>
</div>
</section>
<div id="outline-container-orgd32d083" class="outline-2">
<h2 id="orgd32d083">Objective</h2>
<div class="outline-text-2" id="text-orgd32d083">
<p>
Aspiring Software Developer Co-op leveraging 5+ years of Linux and cloud experience. Skilled in Python, C/C++, Go, and Bash, with hands-on CI/CD (GitHub Actions), containers (Docker, Kubernetes), and infrastructure-as-code. I enjoy building reliable services, contributing to open-source, and shipping clean, testable code.
</p>
</div>
</div>
<div id="outline-container-org84c386d" class="outline-2">
<h2 id="org84c386d">Highlights</h2>
<div class="outline-text-2" id="text-org84c386d">
<ul class="org-ul">
<li>Built and deployed production-grade ML and backend systems using Docker, GitHub Actions, and AWS.</li>
<li>Contributed fixes and tests to major OSS projects (Microsoft Terminal, Matplotlib, Bun, LensKit).</li>
<li>Comfortable across Linux, networking, observability, and performance-minded Go/Python.</li>
</ul>
</div>
</div>
<div id="outline-container-skills" class="outline-2">
<h2 id="skills">Skills</h2>
<div class="outline-text-2" id="text-skills">
</div>
<div id="outline-container-org1aaf714" class="outline-3">
<h3 id="org1aaf714">Programming</h3>
<div class="outline-text-3" id="text-org1aaf714">
<div class="card">
<p>
Python · Go · C/C++ · JavaScript · Bash · Kotlin · Rust · LaTeX
</p>
</div>
</div>
</div>
<div id="outline-container-orgfb9bd13" class="outline-3">
<h3 id="orgfb9bd13">Cloud &amp; DevOps</h3>
<div class="outline-text-3" id="text-orgfb9bd13">
<div class="card">
<p>
AWS (EKS, ECS, RDS, S3) · Docker · Kubernetes · Terraform · Ansible · GitHub Actions · CI/CD
</p>
</div>
</div>
</div>
<div id="outline-container-org961f1ae" class="outline-3">
<h3 id="org961f1ae">CS Fundamentals</h3>
<div class="outline-text-3" id="text-org961f1ae">
<div class="card">
<p>
Data Structures (Arrays, Trees, Graphs, Hash Tables) · Algorithms · Networking · Linux Internals
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-experience" class="outline-2">
<h2 id="experience">Experience</h2>
<div class="outline-text-2" id="text-experience">
<div class="grid">
<div class="card">
<h3>Kinectrics — Artificial Intelligence Intern</h3>
<div class="sub">Toronto, ON · May–Aug 2024</div>
<ul class="list">
<li>Developed YOLOv5 anomaly detection pipelines in Python & Docker; improved accuracy by ~30%.</li>
<li>Defined specs and test plans for ML components; collaborated on system design & architecture.</li>
<li>Automated CI/CD with GitHub Actions (model integration, tests, container deployments).</li>
</ul>
<div>
<span class="chip">Python</span><span class="chip">YOLOv5</span><span class="chip">Docker</span><span class="chip">GitHub Actions</span>
</div>
</div>
<div class="card">
<h3>Fleming — Developer Intern</h3>
<div class="sub">Remote · Jan–Jul 2023</div>
<ul class="list">
<li>Implemented Android features with MVVM & Jetpack; reduced bugs by ~20% via TDD.</li>
<li>Improved REST API reliability with offline caching (Room, LiveData).</li>
<li>Increased code coverage by ~25% with JUnit/Espresso; automated Play Store releases.</li>
</ul>
<div>
<span class="chip">Kotlin</span><span class="chip">Java</span><span class="chip">Android</span><span class="chip">JUnit</span>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-oss" class="outline-2">
<h2 id="oss">Open Source Contributions</h2>
<div class="outline-text-2" id="text-oss">
<div class="grid">
<div class="card">
<h3>Microsoft Terminal — Triple-click Logical Line</h3>
<p>
Enhanced wrapped-line selection to include entire logical lines; added tests and validation.
<a href="https://github.com/microsoft/terminal/pull/18885">PR #18885</a>
</p>
<div><span class="chip">C++</span><span class="chip">Win32</span><span class="chip">Tests</span></div>
</div>
<div class="card">
<h3>LensKit — Mean Average Precision</h3>
<p>
Implemented MAP metric in <code>lenskit.metrics.ranking</code>, refactored rank computations, and added comprehensive tests.
<a href="https://github.com/lenskit/lkpy/pull/739">PR #739</a>
</p>
<div><span class="chip">Python</span><span class="chip">Recsys</span><span class="chip">Testing</span></div>
</div>
<div class="card">
<h3>Bun — TextDecoder fatal option</h3>
<p>
Fixed coercion logic for <code>TextDecoder</code> <code>fatal</code> option; added and formatted tests for CI coverage.
<a href="https://github.com/oven-sh/bun/pull/19378">PR #19378</a>
</p>
<div><span class="chip">JavaScript</span><span class="chip">Web APIs</span></div>
</div>
<div class="card">
<h3>Matplotlib — Pie zero-wedge error</h3>
<p>
Added explicit <code>ValueError</code> when all wedge sizes are zero; improved reliability and tests.
<a href="https://github.com/matplotlib/matplotlib/pull/30019">PR #30019</a>
</p>
<div><span class="chip">Python</span><span class="chip">Testing</span></div>
</div>
<div class="card">
<h3>Linux Kernel — Rust Documentation</h3>
<p>
Documentation improvements for Rust for Linux to help new contributors onboard faster.
<a href="https://lore.kernel.org/rust-for-linux/20250527204928.5117-1-albinbabuvarghese20@gmail.com/">Patch</a>
</p>
<div><span class="chip">Rust</span><span class="chip">Kernel</span><span class="chip">Docs</span></div>
</div>
</div>
</div>
</div>
<div id="outline-container-projects" class="outline-2">
<h2 id="projects">Projects</h2>
<div class="outline-text-2" id="text-projects">
<div class="grid">
<div class="card">
<h3>Food Delivery Backend</h3>
<p>
Go microservices with MongoDB/PostgreSQL/Redis; Nginx for load balancing &amp; SSL; health checks, logging, monitoring; CI/CD via Docker &amp; GitHub Actions; AWS deployment.
</p>
<div><span class="chip">Go</span><span class="chip">PostgreSQL</span><span class="chip">Redis</span><span class="chip">Nginx</span><span class="chip">AWS</span></div>
</div>
<div class="card">
<h3>Pokedex Object Detection App</h3>
<p>
Real-time detection with YOLOv5 in Streamlit; integrated PokeAPI; containerized and deployed on AWS ECS Fargate; CI/CD with automated tests.
</p>
<div><span class="chip">Python</span><span class="chip">YOLOv5</span><span class="chip">Streamlit</span><span class="chip">Docker</span><span class="chip">AWS ECS</span></div>
</div>
</div>
</div>
</div>
<div id="outline-container-education" class="outline-2">
<h2 id="education">Education</h2>
<div class="outline-text-2" id="text-education">
<div class="card kvs">
<div><strong>Seneca Polytechnic</strong></div><div>PG Diploma — Cloud Architecture & Administration (Toronto) · Expected 2025</div>
<div>Coursework</div><div>Data Structures, Algorithms, Terraform, Ansible, Docker, Kubernetes, AWS, Azure</div>
<div><strong>George Brown College</strong></div><div>PG Diploma — Applied AI Solutions Development (Toronto) · 2024 · GPA 3.39</div>
<div><strong>APJ Abdul Kalam Technological University</strong></div><div>B.Tech — Computer Science · 2018–2022</div>
</div>
</div>
</div>
<div id="outline-container-volunteer" class="outline-2">
<h2 id="volunteer">Volunteer</h2>
<div class="outline-text-2" id="text-volunteer">
<div class="grid">
<div class="card">
<h3>Kerala Flood Relief Volunteer</h3>
<p>
Ernakulam, Kerala · Aug 2018 — Coordinated supply distribution, volunteer teams, and local authority liaison.
</p>
</div>
<div class="card">
<h3>Dialysis Patient Support Website</h3>
<p>
AKTU · Mar–May 2021 — React/Node.js app; server-side debugging; MongoDB integration; crowdfunding payments.
</p>
<div><span class="chip">React</span><span class="chip">Node.js</span><span class="chip">MongoDB</span></div>
</div>
</div>
</div>
</div>
<div id="outline-container-org4584e6c" class="outline-2">
<h2 id="org4584e6c">Fun Fact</h2>
<div class="outline-text-2" id="text-org4584e6c">
<p>
I created this webpage using Emacs Org mode and deployed it on Cloudflare Pages.
</p>
</div>
</div>
<div id="outline-container-contact" class="outline-2">
<h2 id="contact">Contact</h2>
<div class="outline-text-2" id="text-contact">
<ul class="org-ul">
<li>Email: <a href="mailto:mail@albinbabuvarghese.com">mail@albinbabuvarghese.com</a></li>
<li>GitHub: <a href="https://github.com/albus-droid">albus-droid</a></li>
<li>LinkedIn: <a href="https://www.linkedin.com/in/albin-babu-varghese/">albin-babu-varghese</a></li>
<li>Location: Toronto, ON</li>
</ul>

<footer>
© <span id="y"></span> Albin Babu Varghese · Built with Emacs Org mode
<script>document.getElementById('y').textContent=new Date().getFullYear()</script>
</footer>

</main>
</div>
</div>
</div>
</body>
</html>
